{
    "title": "Open Data Maturity Model (2024)",
    "description": "<p>The open data maturity model is a way to assess how well an organisation publishes and consumes open data, and identifies actions for improvement.</p><p>The model is based around five themes and five progress levels. Each theme represents a broad area of operations within an organisation. Each theme is then broken into areas of activity, which can then be used to assess progress.</p>",
    "owner": "info@theodi.org",
    "organisation": {
      "name": "The Open Data Institute",
      "homePage": "https://theodi.org",
      "country": {
        "name": "United Kingdom",
        "code": "GB"
      }
    },
    "public": true,
    "levels": ["Initial", "Repeatable", "Defined", "Managed", "Optimising"],
    "dimensions": [
        {
            "name": "Data Publication Processes",
            "activities": [
                {
                    "title": "Data Release Process",
                    "questions": [
                        {
                            "text": "How are datasets published and made accessible to the public?",
                            "statements": [
                            {
                                "text": "There is little or no open data available for public access.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Data is published on an ad-hoc basis across multiple platforms or websites.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "A set of defined datasets is published on a regular schedule.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Datasets are hosted on a managed platform with robust data management capabilities.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Datasets are automatically indexed in external data aggregation portals, ensuring seamless updates.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "Is there a clear and repeatable process for releasing data?",
                            "statements": [
                            {
                                "text": "Data is published using ad-hoc, often manual processes.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Certain teams or projects follow a defined, repeatable process for publishing data.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "There is a consistent, organisation-wide data release process, with a regular release cadence.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "All published datasets follow a standard organisational process for release.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation tracks and measures metrics related to the release process, such as the time between updates.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How is the licensing of datasets managed?",
                            "statements": [
                            {
                                "text": "Licensing is not addressed, leaving data open to viewing but not for reuse.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Datasets are published under an open data licence, enabling both access and reuse.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Licenses include clear attribution statements, making it easy for others to reuse the data.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Licenses are accompanied by detailed documentation explaining what aspects of the dataset are covered, such as structure, format, or third-party content.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "New technologies, such as AI, are assessed for their impact on licensing, ensuring compatibility and evaluating emerging risks.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How are dataset updates managed?",
                            "statements": [
                            {
                                "text": "Datasets are rarely, if ever, updated once published.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some datasets are updated according to a predefined schedule.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Datasets are updated regularly, with updates following a published timetable.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Archived versions of key datasets are maintained to support historical analysis and comparisons.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Reports provide insights into dataset sustainability, highlighting stale datasets and emerging risks.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Standards Development and Adoption",
                    "questions": [
                        {
                            "text": "Are datasets published using common standards?",
                            "statements": [
                            {
                                "text": "Datasets are not released using common standards.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some teams or projects have agreed on specific technical standards for formatting certain types of data.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation has defined a set of key technical data publishing standards, which include data formats and metadata schemas.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "All datasets are released in full conformance with the organisation's technical standards.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation monitors technology trends to ensure datasets are released according to evolving standards and best practices.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How are data formats and accessibility managed?",
                            "statements": [
                            {
                                "text": "Data is available in various formats with no standardisation or quality control.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Data is made available in structured formats that are easy for humans to reuse (e.g., XLS, CSV).",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Most datasets are machine-readable and use standardised column headings and lookup tables for clarity.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Datasets are released in open, non-proprietary formats (e.g., CSV, JSON) and include well-structured metadata.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Datasets are formatted to be AI/ML-ready, following advanced standards for machine readability.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "Is metadata consistently applied to datasets?",
                            "statements": [
                            {
                                "text": "Metadata is not gathered or published alongside datasets.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some metadata is gathered and published, but the quality and completeness are inconsistent.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Metadata is well-structured and adheres to the same quality standards as the data itself.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Metadata follows open standards such as DCAT, ensuring consistency with other datasets.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation uses open standards for both data and metadata, ensuring alignment with other sources.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How is the process of standards management handled within the organisation?",
                            "statements": [
                            {
                                "text": "There is no defined process for managing data standards.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Standards are driven by internal priorities with limited consideration for external data re-users.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "A formal process for data standards management has been defined and is consistently followed across the organisation.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation has a strategic approach for managing data standards and is beginning to adopt open standards.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation optimises its data standards management process by monitoring new technologies and ensuring compatibility with emerging use cases such as AI/ML.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Data Management and Governance",
                    "questions": [
                        {
                            "text": "How consistently are datasets managed?",
                            "statements": [
                            {
                                "text": "Datasets are not managed in any consistent way.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Specific teams or projects have begun defining their own lightweight data management processes, used ad hoc.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation has defined standard data management processes, applied to high-value datasets.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Standard data management processes are applied to all datasets, with the flexibility to tailor processes for specific projects.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation continually monitors and improves its data management processes, ensuring they are optimised for changing needs.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "Is ownership of datasets clearly defined?",
                            "statements": [
                            {
                                "text": "There is no clear ownership around internal datasets.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Specific individuals or teams are informally responsible for certain datasets, but this is not clearly documented.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Each dataset has a well-defined owner, responsible for managing the data throughout its lifecycle.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Ownership is clearly documented for all datasets and regularly reviewed to ensure accountability throughout the data lifecycle.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Ownership structures are fully integrated into the organisation's data governance framework, ensuring that changes in ownership or responsibility are automatically tracked and updated.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How is data quality monitored and maintained?",
                            "statements": [
                            {
                                "text": "Data quality is not actively monitored, and no formal process exists for ensuring data accuracy or completeness.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some datasets are reviewed for quality, but processes are inconsistent and reactive.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "High-value datasets are regularly monitored for quality, and issues are addressed as they arise.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Data quality for all datasets is actively monitored with clear guidelines for addressing quality issues, based on feedback from both internal and external users.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Data quality is proactively improved, with regular assessments and collaboration with external re-users to ensure datasets meet evolving needs and standards.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How is open data governance integrated into the organisation’s processes?",
                            "statements": [
                            {
                                "text": "There is no formal governance process for managing open data.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Specific teams have informal governance processes for releasing open data, but these are inconsistent across the organisation.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation has established a governance framework for managing open data releases, applied to key datasets.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The open data governance framework is applied to all datasets, ensuring consistent practices and monitoring.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation continuously improves its open data governance, incorporating feedback from re-users and monitoring the impact of its data releases.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Compliance and Risk",
                    "questions": [
                        {
                            "text": "How does the organisation manage risks associated with data publication?",
                            "statements": [
                            {
                                "text": "The organisation recognises that there may be risks associated with data, but has not yet defined any processes for assessing and mitigating them.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "The organisation has begun assessing risks associated with some datasets, but the process is informal and not yet documented across the board.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Processes for assessing and mitigating risks are defined and documented. These processes are applied routinely to high-value datasets.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Risk management is fully integrated into the data governance process. All datasets undergo a risk assessment before publication, and mitigation strategies such as anonymisation and aggregation are employed where needed.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation has a comprehensive risk management framework in place, including advanced Privacy Enhancing Technologies (PETs) and external validation for high-risk datasets. The process is transparent and linked to published risk registers.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How are datasets containing personal or sensitive information handled?",
                            "statements": [
                            {
                                "text": "There is no formal process in place for handling datasets containing personal or sensitive information, and no risk assessment is conducted before data release.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "The organisation regularly evaluates the risks and benefits of releasing datasets containing personal or sensitive information, with informal methods for anonymisation or aggregation.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Standard processes for anonymising or aggregating personal or sensitive information are defined and applied to most datasets. Consent or lawful basis for releasing personal data is obtained where necessary.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "All datasets containing personal or sensitive information are subject to strict anonymisation or aggregation processes, with advanced techniques used for de-identification. Personal data is released only when fully compliant with legal frameworks.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation employs cutting-edge techniques for safeguarding personal data, including the use of Privacy Enhancing Technologies (PETs) and routinely monitors new privacy risks. A published open data triage process is in place and includes full transparency on how personal data is handled.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation address ethical considerations in its data practices?",
                            "statements": [
                            {
                                "text": "Ethics is not formally considered in the organisation's data practices or publication processes.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Specific teams or individuals within the organisation are aware of ethical concerns but there is no standardised process for addressing them.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation has developed a standard process for addressing ethical considerations in its data practices, which includes evaluating the potential consequences of data publication.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Ethics is embedded into the data governance process, with routine evaluations of the ethical implications of data releases. Feedback loops are established to address any ethical concerns raised by stakeholders or re-users.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation takes a proactive approach to ethics, regularly reviewing and updating its ethical guidelines. Ethics is treated on par with legal compliance, and the organisation considers the long-term societal impact of its data releases, including the ethical implications of AI/ML use cases.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation ensure compliance with international data standards and legal frameworks?",
                            "statements": [
                            {
                                "text": "The organisation has little awareness or knowledge of relevant international standards or legal frameworks relating to data publication.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "The organisation has begun assessing its compliance with some international standards and legal frameworks, but the process is informal.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation has developed processes to ensure compliance with key international standards and legal frameworks. These processes are applied to high-value datasets.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation routinely monitors compliance with international standards and legal frameworks, and has processes in place to ensure compliance across all datasets.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation actively monitors the changing regulatory landscape and ensures that all datasets comply with the most up-to-date standards and legal requirements. Compliance is externally validated where necessary.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How transparent is the organisation's risk management process?",
                            "statements": [
                            {
                                "text": "There is no transparency around the organisation's risk management process, and the public has no insight into the risks associated with published datasets.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some information about the risks associated with data publication is available internally, but this information is not made public.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation publishes a risk register for key datasets, outlining potential risks and mitigation strategies. However, this register is incomplete.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "A comprehensive risk register is published and regularly updated, with detailed mitigation strategies for each dataset. The organisation is transparent about how risks are assessed and managed.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation's risk management process is fully transparent, with regular updates to the risk register and the inclusion of feedback from external stakeholders. The risk register is linked to the organisation's open data triage process and is accessible to the public.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Data Literacy and Skills",
            "activities": [
                {
                    "title": "Open Data Expertise",
                    "questions": [
                        {
                            "text": "How does the organisation assess and support open data expertise?",
                            "statements": [
                            {
                                "text": "Current open data activities rely on the knowledge of a small number of stakeholders, with no formal strategy for expanding this expertise.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Data professionals are embedded in teams, but there is no centralised strategy to develop open data expertise across the organisation.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Open data expertise is centralised in a few key individuals or teams, and the organisation partners with external specialists when required.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "There is a centralised open data team or network of experts, with clear roles and responsibilities defined across teams to support open data initiatives.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation fosters open data expertise across all levels, including external networks and partnerships that advance open data practices globally.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation encourage the growth of open data skills?",
                            "statements": [
                            {
                                "text": "There are no formal training or mentoring programmes related to open data.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Training around open data is provided on an ad-hoc basis, driven by the needs of specific projects.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Internal open data experts mentor and support others, and there are growing training opportunities for staff.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Open data awareness and training are a standard part of staff development, and mentorship programmes are well established.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Open data training is embedded across all roles and is tailored to individual needs, with an active internal and external mentoring network.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Understanding Learning Needs",
                    "questions": [
                        {
                            "text": "How does the organisation identify its data literacy and skills needs?",
                            "statements": [
                            {
                                "text": "There is no formal process for identifying data literacy and skills needs within the organisation.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some teams and individuals have identified their learning needs, but there is no organisation-wide analysis or process.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation has undertaken a learning needs analysis and has identified key areas where data literacy and skills need improvement.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation conducts a structured learning needs analysis on a regular basis, identifying gaps in data literacy and aligning them with strategic objectives.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation continuously evaluates data literacy needs, aligning them with future business needs, and tracks how learning impacts organisational performance.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How are opportunities for learning and development provided?",
                            "statements": [
                            {
                                "text": "There are limited or no opportunities for learning about data skills and literacy within the organisation.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Learning resources are available, but they are often ad-hoc and focus on specific projects rather than broader organisational needs.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation provides some structured learning opportunities, focusing on developing core data skills across teams.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation has well-defined learning programmes, and staff are actively encouraged to take part in data literacy training aligned with strategic goals.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Learning and development programmes are fully embedded, with tailored opportunities available for all staff to continuously improve their data literacy and skills.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Strategic Data Skills and Literacy",
                    "questions": [
                        {
                            "text": "How are data literacy and skills driven strategically across the organisation?",
                            "statements": [
                            {
                                "text": "There is no strategic ownership of data literacy and skills development within the organisation.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "The organisation has appointed a strategic owner for data literacy, but efforts are limited to tool-specific training (e.g. Excel).",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation provides internal training for data literacy, though it is still generic and not linked to specific job roles or strategic goals.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Data literacy and skills are embedded into performance reviews, and the organisation actively drives data literacy as a key strategic focus.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation continuously aligns its data literacy and skills development with broader strategic objectives, tracking KPIs and regularly adjusting its approach to meet future business needs.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation support teams with limited data expertise?",
                            "statements": [
                            {
                                "text": "Teams with limited data expertise have no formal support for building skills or accessing data literacy resources.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some teams with limited data expertise are supported by ad-hoc resources, such as project-based training or external consultants.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Teams with limited data expertise are supported by centrally managed resources, such as data champions or dedicated data professionals.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "There is a clear support structure in place for teams with limited data expertise, including access to mentors, training programmes, and centrally managed data teams.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation provides tailored, continuous support to teams with limited data expertise, ensuring they are fully integrated into data-driven projects and have access to the necessary skills and resources.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Customer Support and Engagement",
            "activities": [
                {
                    "title": "Engagement and community building",
                    "questions": [
                        {
                            "text": "How does the organisation engage with stakeholders and build a community around open data?",
                            "statements": [
                            {
                                "text": "There is no systematic attempt to identify potential re-users, and communication with stakeholders is informal or absent.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some teams engage with stakeholders on an ad-hoc basis, but information about re-users and stakeholders is siloed.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Stakeholders are regularly identified and mapped, and there is a process for engaging them across different data releases.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation proactively seeks to engage stakeholders before and after data releases, using feedback to improve future publications.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "There is a comprehensive stakeholder engagement strategy linked to organisational goals, and the organisation actively builds and nurtures an external community of re-users.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation prioritise and communicate its data releases?",
                            "statements": [
                            {
                                "text": "Data releases are driven by short-term internal priorities with little communication to external stakeholders.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some data releases are based on external demands, but there is no clear, coordinated process for prioritising publications.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Data releases are driven by re-user demand, with a process in place for stakeholders to request datasets.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation's data release strategy is communicated clearly to stakeholders, with a repeatable process to guide engagement and publication.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Data release priorities are informed by continuous dialogue with the community, and the organisation monitors and adjusts its strategy based on feedback and impact assessments.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation collaborate with others to improve open data practices?",
                            "statements": [
                            {
                                "text": "The organisation has little or no collaboration with other organisations regarding open data.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "There is some ad-hoc collaboration with peer organisations within the same sector to share knowledge about open data.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "The organisation is engaged in sector-wide efforts to improve open data practices and supports external initiatives reactively.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation plays an active role in sector-level collaborations to advance open data practices, contributing proactively to cross-organisational efforts.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation leads sector-level initiatives to advance open data, establishing best practices and fostering innovation through challenges, partnerships, and dedicated engagement groups.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Re-user support processes",
                    "questions": [
                        {
                            "text": "How does the organisation support re-users of its data?",
                            "statements": [
                            {
                                "text": "There is no formal support for re-users, and individuals must find their own ways to access help.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some re-users can access ad-hoc support, but there are no centralised processes for providing help.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "A central support team exists, and re-users are provided with clear contact points to seek help regarding datasets.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "The organisation actively promotes its support offerings, providing clear expectations (e.g., response times) and fostering open communication through multiple channels (e.g., forums, social media).",
                                "associatedLevel": 4
                            },
                            {
                                "text": "The organisation measures the effectiveness of its support operations, ensuring re-users receive prompt responses and issues are addressed swiftly, using feedback to improve support processes.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How does the organisation obtain feedback from re-users?",
                            "statements": [
                            {
                                "text": "There is no systematic way to collect feedback from re-users, and issues are not actively monitored or addressed.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Individual teams collect feedback on an ad-hoc basis, but this is not shared or coordinated across the organisation.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Feedback is collected through formal channels, such as user forums, and there is a process for addressing issues that arise.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Re-users' feedback is routinely captured, analysed, and used to drive improvements in datasets and support processes.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Feedback collection is embedded into the organisation's processes, and the organisation routinely collaborates with re-users to enhance the quality and usefulness of its datasets and support services.",
                                "associatedLevel": 5
                            }
                            ]
                        },
                        {
                            "text": "How are re-user metrics monitored and used to improve data and support?",
                            "statements": [
                            {
                                "text": "There is no monitoring of how re-users interact with datasets or the support process.",
                                "associatedLevel": 1
                            },
                            {
                                "text": "Some metrics are collected, but these are sporadic and focus on a limited number of datasets.",
                                "associatedLevel": 2
                            },
                            {
                                "text": "Metrics on re-user interactions are collected routinely, and they are analysed to inform improvements in data publication and user support.",
                                "associatedLevel": 3
                            },
                            {
                                "text": "Metrics are captured in an automated and structured way, providing insights into the impact of datasets and the efficiency of support operations.",
                                "associatedLevel": 4
                            },
                            {
                                "text": "Re-user metrics are continuously monitored, with insights driving strategic improvements in both data quality and user support services. Feedback loops ensure ongoing optimisation of the process.",
                                "associatedLevel": 5
                            }
                            ]
                        }
                    ]
                },
                {
                    "title": "Open data documentation",
                    "questions": [
                        {
                        "text": "What level of documentation is provided with published datasets?",
                            "statements": [
                                {
                                "text": "Datasets are released with little or no supporting documentation.",
                                "associatedLevel": 1
                                },
                                {
                                "text": "The level of documentation provided is inconsistent and depends on individual efforts.",
                                "associatedLevel": 2
                                },
                                {
                                "text": "A standard set of documentation and metadata is defined, but it is only applied to some datasets, typically high-value ones.",
                                "associatedLevel": 3
                                },
                                {
                                "text": "All datasets are released with a standard set of supporting documentation and metadata using established templates.",
                                "associatedLevel": 4
                                },
                                {
                                "text": "The organisation routinely provides comprehensive documentation and high-quality metadata for all datasets.",
                                "associatedLevel": 5
                                }
                            ]
                        },
                        {
                        "text": "How does the organisation ensure the quality and consistency of documentation?",
                        "statements":
                            [
                                {
                                "text": "There are no established processes to ensure the quality or consistency of documentation across datasets.",
                                "associatedLevel": 1
                                },
                                {
                                "text": "Some teams have started using templates or guidelines to create documentation, but these are applied inconsistently.",
                                "associatedLevel": 2
                                },
                                {
                                "text": "The organisation has developed a standard approach for documentation, but not all datasets conform to these standards.",
                                "associatedLevel": 3
                                },
                                {
                                "text": "All datasets conform to an established documentation process, and this process is integrated into the data publishing workflow.",
                                "associatedLevel": 4
                                },
                                {
                                "text": "Supporting documentation and metadata creation are fully integrated into the publishing process and regularly reviewed for consistency.",
                                "associatedLevel": 5
                                }
                            ]
                        },
                        {
                        "text": "How does the organisation gather feedback on documentation from re-users?",
                        "statements":
                            [
                                {
                                "text": "There is no formal process for gathering feedback on documentation from re-users.",
                                "associatedLevel": 1
                                },
                                {
                                "text": "Some re-users provide feedback informally, but there is no systematic approach to gathering or addressing their input.",
                                "associatedLevel": 2
                                },
                                {
                                "text": "A formal process is in place for re-users to provide feedback on documentation, and this is occasionally used to make improvements.",
                                "associatedLevel": 3
                                },
                                {
                                "text": "The organisation actively seeks feedback from re-users on documentation, and improvements are regularly made based on their input.",
                                "associatedLevel": 4
                                },
                                {
                                "text": "Re-users are encouraged to contribute to the improvement of documentation, and the organisation promotes the use of third-party resources and tools to supplement its documentation.",
                                "associatedLevel": 5
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Investment and Financial Performance",
            "activities": [
                {
                    "title": "Financial oversight and procurement",
                    "questions": [
                        {
                            "text": "How is funding managed for open data publication and its lifecycle?",
                            "statements": [
                                {
                                    "text": "Data releases are unfunded and handled as exceptional, unplanned expenditure.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Individual projects include open data publication costs as part of their specific project budget, without considering longer-term costs.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Project funding includes long-term costs for open data publication, and responsibility for these costs is explicitly assigned to roles within the organisation.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation actively monitors the financial costs and benefits of open data publication as part of ongoing data governance processes.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation seeks efficiency savings and sustainability strategies in open data publication, optimising data management and reducing licensing overheads where possible.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How does the organisation ensure long-term sustainability in open data publication and management?",
                            "statements": [
                                {
                                    "text": "There is no long-term sustainability plan for the ongoing management of published open data.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Open data is managed through short-term project funding without considering its long-term lifecycle.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "The organisation has a sustainability plan that includes budgeting for ongoing updates and management of key datasets.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "Sustainability planning is integrated into the organisation's data governance, ensuring consistent funding and updates for high-value datasets.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation actively seeks external partnerships or additional funding streams to ensure the long-term sustainability of open data.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How does the organisation address open data in procurement processes and contracts?",
                            "statements": [
                                {
                                    "text": "Procurement processes and contracts do not address data supply, licensing, or re-use.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "The organisation seeks clarity around data rights retrospectively when it comes to procurement, in order to drive more open data adoption.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Some procurement activities and contracts are tailored to address open data licensing and re-use, depending on project needs.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation includes standard clauses in contracts and procurement activities to ensure clarity around data rights and re-use.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "All procurement processes and contracts include explicit reference to open data rights and re-use where applicable, and these are standard across all projects.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How does the organisation manage its rights to release and re-use data from contracts or partnerships?",
                            "statements": [
                                {
                                    "text": "The organisation is unaware of its rights to release or re-use data resulting from contracts or partnerships.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "The organisation is beginning to clarify its rights to release data retrospectively, but this is done on a project-by-project basis.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Clear processes are in place to ensure the organisation understands its rights to release and re-use data from contracts and partnerships.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation has an established process for ensuring that rights to release and re-use data are clear in all contracts and partnerships.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "Rights management for open data is fully integrated into all procurement and partnership processes, ensuring clarity from the outset for all contracts.",
                                    "associatedLevel": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "Understanding the value of open data",
                    "questions": [
                        {
                            "text": "How does the organisation quantify the value of its open data?",
                            "statements": [
                                {
                                    "text": "No attempt is made to quantify the value of published or re-used datasets.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "The organisation carries out some qualitative reporting on the value of datasets, but it is largely described in general terms without standardisation.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Valuation of datasets is done retrospectively, and the organisation uses qualitative methods across themes such as economic, social, and environmental benefits.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation has adopted a standardised approach for describing the value of its datasets, including quantitative methods for measuring ROI.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "All datasets are consistently valued using standard methods, with the valuation used to guide strategic investment decisions.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How is the value of open data communicated to stakeholders and re-users?",
                            "statements": [
                                {
                                    "text": "There is no communication or reporting on the value of open data to internal or external stakeholders.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some general benefits of open data are communicated through qualitative reports, but there are no clear actionable insights.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Periodic reports are shared on the value of open data, often with specific use cases or examples of re-use, demonstrating the value retrospectively.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation regularly publishes detailed reports on the value of its open data, including case studies, known re-uses, and stakeholder feedback.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "Reports are strategic and transparent, guiding future data releases and aligning with stakeholder needs. Feedback loops are established for ongoing improvement.",
                                    "associatedLevel": 5
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Strategic oversight",
            "activities": [
                {
                    "title": "Open data strategy",
                    "questions": [
                        {
                            "text": "Does the organisation have a defined open data strategy?",
                            "statements": [
                                {
                                    "text": "The organisation has no strategy or policy with regards to open data.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Open data initiatives are viewed as experimental or driven by external factors, without a formal strategy.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "The organisation has a documented open data strategy that addresses key areas such as governance, data management, and open data publishing.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation has an open data strategy that is aligned with wider organisational goals and is supported by measurable targets for implementation.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "Open data is a critical component of the organisation’s overall strategy, and it is continuously reviewed to ensure alignment with evolving goals.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "Who is responsible for delivering the open data strategy?",
                            "statements": [
                                {
                                    "text": "There is no clear ownership or accountability for open data within the organisation.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some parts of the organisation, such as project teams or departments, have developed their own strategies for open data.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Responsibility for the open data strategy is assigned at the senior management level, and ownership for data processes is well-defined.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "Senior management is fully engaged, and performance assessment of key executives is tied to the delivery of the open data strategy.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "There is broad organisational ownership of the open data strategy, with clear roles and responsibilities for its ongoing evolution and delivery.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How does the organisation measure the impact and alignment of the open data strategy?",
                            "statements": [
                                {
                                    "text": "There are no formal metrics or goals associated with the open data strategy.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some benefits of open data are identified, but there are no clear metrics for measuring its impact.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Measurable targets are set for the implementation of the open data strategy, with regular reviews of progress.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation tracks the performance of the open data strategy through defined metrics that are aligned with organisational objectives.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "Metrics and goals are regularly reviewed and updated, ensuring alignment with organisational priorities and driving continuous improvement.",
                                    "associatedLevel": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "Asset catalogue",
                    "questions": [
                        {
                            "text": "How is the organisation's asset catalogue created and maintained?",
                            "statements": [
                                {
                                    "text": "There is no systematic approach to managing data sources as assets, and no asset catalogue exists.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Individual teams or projects maintain separate directories of the data assets they use, but there is no central coordination.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "An organisation-wide data asset catalogue has been developed to identify key datasets being published and used.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The catalogue is kept up to date and includes all high-value datasets across the organisation.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation has an exhaustive asset catalogue that includes all datasets, not just high-value ones, and it is routinely maintained.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How comprehensive is the asset catalogue and how is it managed?",
                            "statements": [
                                {
                                    "text": "There is no formal method for managing or updating the catalogue.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some teams or departments manage their own catalogues, but there is limited coordination or formal process for updating them.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "The organisation's high-value datasets are included in the catalogue, but there are gaps in comprehensiveness or coordination across departments.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The catalogue includes all datasets that are used or published by the organisation, and there is a formal process in place for ensuring it is regularly updated.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The asset catalogue is managed comprehensively, and its upkeep is fully integrated into the organisation's data management strategy, with clear accountability.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How is the asset catalogue used and applied within the organisation?",
                            "statements": [
                                {
                                    "text": "The asset catalogue, if it exists, is not used to inform decision-making or project planning.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some teams make use of the asset catalogue to avoid duplicating datasets, but its application is inconsistent across the organisation.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "New projects and products attempt to reuse datasets referenced in the catalogue to prevent unnecessary duplication.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The catalogue is a critical resource for project planning, and the organisation strives for efficiency by reusing existing datasets whenever possible.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation actively identifies overlaps and commonalities between datasets in the catalogue, achieving cost and efficiency savings by aligning or consolidating datasets.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "Is the asset catalogue shared externally, and how is it used to improve transparency?",
                            "statements": [
                                {
                                    "text": "There is no publicly available asset catalogue, and no external transparency around the organisation’s data holdings.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some information about data assets is shared externally, but it is sporadic and incomplete.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "Elements of the organisation's asset catalogue are publicly available as open data, providing transparency into key datasets.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The asset catalogue is regularly published and includes details about datasets that have not yet been released to help external users understand upcoming resources.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation publishes its entire asset catalogue, including metadata and descriptions, and actively engages with external stakeholders to improve the quality and relevance of the datasets it holds.",
                                    "associatedLevel": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "Responsible data stewardship",
                    "questions": [
                        {
                            "text": "How well does the organisation understand and assign responsibilities for data stewardship?",
                            "statements": [
                                {
                                    "text": "There is little to no understanding of the concept of data stewardship, and responsibilities are undefined.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "There are defined responsibilities around data stewardship, including collecting, using, and sharing data. A specific job role may exist for these tasks.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "The organisation has a clear, public identity as a steward of data, with committed responsibilities for data collection, sharing, and use.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "Data stewardship responsibilities include publishing open data, securely sharing sensitive data, and building and maintaining data infrastructure.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation has a system in place for continually assessing data stewardship responsibilities, ensuring data is used for public benefit and mitigating harm.",
                                    "associatedLevel": 5
                                }
                            ]
                        },
                        {
                            "text": "How does the organisation demonstrate and improve its commitment to responsible data stewardship?",
                            "statements": [
                                {
                                    "text": "There is no public commitment or action plan regarding responsible data stewardship.",
                                    "associatedLevel": 1
                                },
                                {
                                    "text": "Some public actions are taken to demonstrate responsible data stewardship, but these are limited to basic compliance with regulations.",
                                    "associatedLevel": 2
                                },
                                {
                                    "text": "The organisation demonstrates a clear, public commitment to responsible data stewardship, with ongoing actions and responsibilities.",
                                    "associatedLevel": 3
                                },
                                {
                                    "text": "The organisation adopts a systemic, iterative process to ensure data is used ethically, addressing public benefit and structural inequalities.",
                                    "associatedLevel": 4
                                },
                                {
                                    "text": "The organisation shows leadership in responsible data stewardship, with a proven public track record, and actively helps other organisations on their stewardship journey.",
                                    "associatedLevel": 5
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
